# # a =1 #int
# # b = 2.5 #float
# # c = 'htllo' # str
# # d = [1, 2, 3, 4, 5] #list
# # e = (1, 2, 3, 4, 5) # tuple
# # f = True # bool
# # g = None #NonrType
# # h = {'a': 2, 'b': 1} #dict
# # i = {1, 2, 3} #set

# a =1
# b = 2

# print(type(a))
# #арифметика
# a+b
# a-b
# a*b
# a/b
# a**b #возведение в степень
# pow(a, b)
# abs(a) #модуль числа
# a//b # целая часть деление
# a%b #остаток от деление
# round(2.56983)#округления  
# round(2.53265, 2) # округления до n знаков

# a=0.1
# b=0.2
# c=0.5
# d=0.2
# e=0.3
# print(a+b+c+d+e)
from decimal import Decimal

a = Decimal ('0.1')
b= Decimal ('10')
# print(a+a+a+a+a+a+a+a)
print(b**2)

# == #проверка на равенство
# != #проверка на неравенство
# 1. Называние перменой должно быт на латинице и должно выражать смысль присвоенного значения 
# 2. называния переменной не содержать пробел1. Называние перменой должно быт на латинице и должно выражать смысль присвоенного значения 
# 2. называния переменной не содержать пробел1. Называние перменой должно быт на латинице и должно выражать смысль присвоенного значения 
# 2. называния переменной не содержать пробел

# in  -проверяет находится ли определеный обект в какой то 
# последователности(строке списке кортаже словаре)
# a = 'Hello world'
# print('o' in a # True)

# is  проверка на ижентичность явя ли 2 обекта одним и тем же обектом совпадают ли их id 

#  len() находить длтну последовательность(строки списки картежа словаря множества)

#  and, not, or, - логические операторы